<?php
$n1 = 52;
$n2 = 89;

echo "Введите первое число: " . $n1 . "\n";
echo "Введите второе число: " . $n2 . "\n\n";

$sum = $n1 + $n2;
echo "Сложение: " . $n1 . " + " . $n2 . " = " . $sum . "\n";

$difference = $n1 - $n2;
echo "Вычитание: " . $n1 . " - " . $n2 . " = " . $difference . "\n";

if ($n2 != 0) {
    $division = $n1 / $n2;
    echo "Деление: " . $n1 . " / " . $n2 . " = " . $division . "\n";
} else {
    echo "Деление: Ошибка! Деление на ноль невозможно.\n";
}

$expon = pow($n1, $n2);
echo "Возведение в степень: " . $n1 . " ^ " . $n2 . " = " . $expon . "\n";
?>